doc/ch02-derivatives/05-trace.org
#+TITLE:Sec2.5 Derivatives of Traces
#+AUTHOR: Wan-Duo Kurt Ma
#+EMAIL: Wan-Duo.Ma@ecs.vuw.ac.nz
#+DATE:Sun Nov 29 00:26:06 2020
#+OPTIONS: H:2 num:nil toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t
#+DESCRIPTION:
#+KEYWORDS:
#+INCLUDE: ../header.org

* Sec2.5 Derivatives of Traces
I'll use taylor expansion identity for the most of the derivations. e.g., [[file:..//ch00-cheat/01-think.org::Taylor expansion][link]] 

* Eq99
** problem
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{X})\big) = \mathbf{I}
\end{split}
\end{equation}
#+END_LaTeX

** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{X}+\mathbf{H}) - \text{Tr}(\mathbf{X})
  &= \text{Tr}(\mathbf{X})+\text{Tr}(\mathbf{H}) - \text{Tr}(\mathbf{X}) \\
  &= \text{Tr}(\mathbf{H}) \\
  &= \text{Tr}(\mathbf{I}\mathbf{H}) \\
  &= \left \langle \mathbf{I}, \mathbf{H}  \right \rangle
\end{split}
\end{equation}
#+END_LaTeX

* Eq100

** problem
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{X}\mathbf{A})\big) = \mathbf{A}^T
\end{split}
\end{equation}
#+END_LaTeX

** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{X}+\mathbf{H}) - \text{Tr}(\mathbf{X})
  &= \text{Tr}((\mathbf{X}+\mathbf{H})\mathbf{A}) - \text{Tr}(\mathbf{X}\mathbf{A}) \\
  &= \text{Tr}(\mathbf{X}\mathbf{A}+\mathbf{H}\mathbf{A}) - \text{Tr}(\mathbf{X}\mathbf{A}) \\
  &= \text{Tr}(\mathbf{H}\mathbf{A}) \\
  &= \left \langle \mathbf{A}^T, \mathbf{H}  \right \rangle\\  
\end{split}
\end{equation}
#+END_LaTeX

* Eq101

** problem
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B})\big) = \mathbf{A}^T\mathbf{B}^T
\end{split}
\end{equation}
#+END_LaTeX

** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{A}(\mathbf{X}+\mathbf{H})\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B})
  &= \text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B}) + \text{Tr}(\mathbf{A}\mathbf{H}\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B})\\
  &= \text{Tr}(\mathbf{A}\mathbf{H}\mathbf{B}) \\
  &= \text{Tr}(\mathbf{B}\mathbf{A}\mathbf{H}) \quad \ \text{cyclic property}\\
  &= \left \langle (\mathbf{B}\mathbf{A})^T, \mathbf{H}  \right \rangle \\
  &= \left \langle \mathbf{A}^T\mathbf{B}^T, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}
#+END_LaTeX

* Eq102

** problem
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B})\big) = \mathbf{B}\mathbf{A}
\end{split}
\end{equation}
#+END_LaTeX

** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{A}(\mathbf{X}+\mathbf{H})^T\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B})
  &= \text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B}) + \text{Tr}(\mathbf{A}\mathbf{H}^T\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B})\\
  &= \text{Tr}(\mathbf{A}\mathbf{H}^T\mathbf{B}) \\
  &= \text{Tr}(\mathbf{H}^T\mathbf{B}\mathbf{A}) \quad \ \text{cyclic property}\\
  &= \left \langle \mathbf{B}\mathbf{A}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}
#+END_LaTeX

* Eq103
** problem
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{X}^T\mathbf{A})\big) = \mathbf{A}
\end{split}
\end{equation}
** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}((\mathbf{X}+\mathbf{H})^T\mathbf{A}) - \text{Tr}(\mathbf{X}^T\mathbf{A})
  &= \text{Tr}(\mathbf{X}^T\mathbf{A}) + \text{Tr}(\mathbf{H}^T\mathbf{A}) - \text{Tr}(\mathbf{X}^T\mathbf{A})\\
  &= \text{Tr}(\mathbf{H}^T\mathbf{A}) \\
  &= \left \langle \mathbf{A}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}
#+END_LaTeX


* Eq104
** problem
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A}\mathbf{X}^T)\big) = \mathbf{A}
\end{split}
\end{equation}
** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}((\mathbf{A}(\mathbf{X}+\mathbf{H})^T) - \text{Tr}(\mathbf{A}\mathbf{X}^T)
  &= \text{Tr}(\mathbf{A}\mathbf{X}^T) + \text{Tr}(\mathbf{A}\mathbf{H}^T) - \text{Tr}(\mathbf{A}\mathbf{X}^T)\\
  &= \text{Tr}(\mathbf{A}\mathbf{H}^T) \\
  &= \text{Tr}(\mathbf{H}^T\mathbf{A}) \\
  &= \left \langle \mathbf{A}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}
#+END_LaTeX

* Eq105
** problem
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A} \otimes \mathbf{X})\big) = \text{Tr}(\mathbf{A})\mathbf{I}
\end{split}
\end{equation}
** derivation
#+BEGIN_LaTeX latex
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{A} \otimes (\mathbf{X}+\mathbf{H})) - \text{Tr}(\mathbf{A} \otimes \mathbf{X})
  &= \text{Tr}(\mathbf{A} \otimes \mathbf{X}) + \text{Tr}(\mathbf{A} \otimes \mathbf{H}) - \text{Tr}(\mathbf{A} \otimes \mathbf{X})\\
  &= \text{Tr}(\mathbf{A} \otimes \mathbf{H}) \\
  &= \text{Tr}(\mathbf{A})\text{Tr}(\mathbf{H}) \\
  &= \text{Tr}(\mathbf{A})\text{Tr}(\mathbf{I}\mathbf{H}) \\
  &= \text{Tr}(\mathbf{A}) \left \langle \mathbf{I}, \mathbf{H}  \right \rangle \\
  &= \left \langle \text{Tr}(\mathbf{A}) \mathbf{I}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}
#+END_LaTeX
