doc/ch02-derivatives/05-trace.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-29 Sun 01:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sec2.5 Derivatives of Traces</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wan-Duo Kurt Ma Wan-Duo Kurt Ma" />
<link rel='stylesheet' type='text/css' href='https://web.stanford.edu/~ksb/css/esquemadorg.css'></link>
</head>
<body>
<div id="content">
<h1 class="title">Sec2.5 Derivatives of Traces</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd27c979">Sec2.5 Derivatives of Traces</a></li>
<li><a href="#orgf42b16c">Eq99</a>
<ul>
<li><a href="#org1cb8242">problem</a></li>
<li><a href="#org0032e78">derivation</a></li>
</ul>
</li>
<li><a href="#orgf54ad3f">Eq100</a>
<ul>
<li><a href="#org13ca065">problem</a></li>
<li><a href="#org84dd9b7">derivation</a></li>
</ul>
</li>
<li><a href="#orgf112f3e">Eq101</a>
<ul>
<li><a href="#org4d62009">problem</a></li>
<li><a href="#org36c745f">derivation</a></li>
</ul>
</li>
<li><a href="#orge6dbff5">Eq102</a>
<ul>
<li><a href="#orgadac173">problem</a></li>
<li><a href="#orgfa10fb5">derivation</a></li>
</ul>
</li>
<li><a href="#orgd12ffa8">Eq103</a>
<ul>
<li><a href="#orgd17cbed">problem</a></li>
<li><a href="#org6753958">derivation</a></li>
</ul>
</li>
<li><a href="#org7e7d807">Eq104</a>
<ul>
<li><a href="#org8d20462">problem</a></li>
<li><a href="#orgd5ee7b9">derivation</a></li>
</ul>
</li>
<li><a href="#org277a000">Eq105</a>
<ul>
<li><a href="#orga383ab5">problem</a></li>
<li><a href="#org4e9bce0">derivation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd27c979" class="outline-2">
<h2 id="orgd27c979">Sec2.5 Derivatives of Traces</h2>
<div class="outline-text-2" id="text-orgd27c979">
<p>
I'll use taylor expansion identity for the most of the derivations. e.g., <a href="..//ch00-cheat/01-think.html#MissingReference">link</a> 
</p>
</div>
</div>

<div id="outline-container-orgf42b16c" class="outline-2">
<h2 id="orgf42b16c">Eq99</h2>
<div class="outline-text-2" id="text-orgf42b16c">
</div>
<div id="outline-container-org1cb8242" class="outline-3">
<h3 id="org1cb8242">problem</h3>
<div class="outline-text-3" id="text-org1cb8242">
<div class="LaTeX">
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{X})\big) = \mathbf{I}
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org0032e78" class="outline-3">
<h3 id="org0032e78">derivation</h3>
<div class="outline-text-3" id="text-org0032e78">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{X}+\mathbf{H}) - \text{Tr}(\mathbf{X})
  &= \text{Tr}(\mathbf{X})+\text{Tr}(\mathbf{H}) - \text{Tr}(\mathbf{X}) \\
  &= \text{Tr}(\mathbf{H}) \\
  &= \text{Tr}(\mathbf{I}\mathbf{H}) \\
  &= \left \langle \mathbf{I}, \mathbf{H}  \right \rangle
\end{split}
\end{equation}

</div>
</div>
</div>
</div>

<div id="outline-container-orgf54ad3f" class="outline-2">
<h2 id="orgf54ad3f">Eq100</h2>
<div class="outline-text-2" id="text-orgf54ad3f">
</div>
<div id="outline-container-org13ca065" class="outline-3">
<h3 id="org13ca065">problem</h3>
<div class="outline-text-3" id="text-org13ca065">
<div class="LaTeX">
\begin{equation}
\begin{split}
\frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{X}\mathbf{A})\big) = \mathbf{A}^T
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org84dd9b7" class="outline-3">
<h3 id="org84dd9b7">derivation</h3>
<div class="outline-text-3" id="text-org84dd9b7">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{X}+\mathbf{H}) - \text{Tr}(\mathbf{X})
  &= \text{Tr}((\mathbf{X}+\mathbf{H})\mathbf{A}) - \text{Tr}(\mathbf{X}\mathbf{A}) \\
  &= \text{Tr}(\mathbf{X}\mathbf{A}+\mathbf{H}\mathbf{A}) - \text{Tr}(\mathbf{X}\mathbf{A}) \\
  &= \text{Tr}(\mathbf{H}\mathbf{A}) \\
  &= \left \langle \mathbf{A}^T, \mathbf{H}  \right \rangle\\  
\end{split}
\end{equation}

</div>
</div>
</div>
</div>

<div id="outline-container-orgf112f3e" class="outline-2">
<h2 id="orgf112f3e">Eq101</h2>
<div class="outline-text-2" id="text-orgf112f3e">
</div>
<div id="outline-container-org4d62009" class="outline-3">
<h3 id="org4d62009">problem</h3>
<div class="outline-text-3" id="text-org4d62009">
<div class="LaTeX">
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B})\big) = \mathbf{A}^T\mathbf{B}^T
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org36c745f" class="outline-3">
<h3 id="org36c745f">derivation</h3>
<div class="outline-text-3" id="text-org36c745f">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{A}(\mathbf{X}+\mathbf{H})\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B})
  &= \text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B}) + \text{Tr}(\mathbf{A}\mathbf{H}\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}\mathbf{B})\\
  &= \text{Tr}(\mathbf{A}\mathbf{H}\mathbf{B}) \\
  &= \text{Tr}(\mathbf{B}\mathbf{A}\mathbf{H}) \quad \ \text{cyclic property}\\
  &= \left \langle (\mathbf{B}\mathbf{A})^T, \mathbf{H}  \right \rangle \\
  &= \left \langle \mathbf{A}^T\mathbf{B}^T, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}

</div>
</div>
</div>
</div>

<div id="outline-container-orge6dbff5" class="outline-2">
<h2 id="orge6dbff5">Eq102</h2>
<div class="outline-text-2" id="text-orge6dbff5">
</div>
<div id="outline-container-orgadac173" class="outline-3">
<h3 id="orgadac173">problem</h3>
<div class="outline-text-3" id="text-orgadac173">
<div class="LaTeX">
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B})\big) = \mathbf{B}\mathbf{A}
\end{split}
\end{equation}

</div>
</div>
</div>

<div id="outline-container-orgfa10fb5" class="outline-3">
<h3 id="orgfa10fb5">derivation</h3>
<div class="outline-text-3" id="text-orgfa10fb5">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{A}(\mathbf{X}+\mathbf{H})^T\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B})
  &= \text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B}) + \text{Tr}(\mathbf{A}\mathbf{H}^T\mathbf{B}) - \text{Tr}(\mathbf{A}\mathbf{X}^T\mathbf{B})\\
  &= \text{Tr}(\mathbf{A}\mathbf{H}^T\mathbf{B}) \\
  &= \text{Tr}(\mathbf{H}^T\mathbf{B}\mathbf{A}) \quad \ \text{cyclic property}\\
  &= \left \langle \mathbf{B}\mathbf{A}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}

</div>
</div>
</div>
</div>

<div id="outline-container-orgd12ffa8" class="outline-2">
<h2 id="orgd12ffa8">Eq103</h2>
<div class="outline-text-2" id="text-orgd12ffa8">
</div>
<div id="outline-container-orgd17cbed" class="outline-3">
<h3 id="orgd17cbed">problem</h3>
<div class="outline-text-3" id="text-orgd17cbed">
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{X}^T\mathbf{A})\big) = \mathbf{A}
\end{split}
\end{equation}
</div>
</div>
<div id="outline-container-org6753958" class="outline-3">
<h3 id="org6753958">derivation</h3>
<div class="outline-text-3" id="text-org6753958">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}((\mathbf{X}+\mathbf{H})^T\mathbf{A}) - \text{Tr}(\mathbf{X}^T\mathbf{A})
  &= \text{Tr}(\mathbf{X}^T\mathbf{A}) + \text{Tr}(\mathbf{H}^T\mathbf{A}) - \text{Tr}(\mathbf{X}^T\mathbf{A})\\
  &= \text{Tr}(\mathbf{H}^T\mathbf{A}) \\
  &= \left \langle \mathbf{A}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}

</div>
</div>
</div>
</div>


<div id="outline-container-org7e7d807" class="outline-2">
<h2 id="org7e7d807">Eq104</h2>
<div class="outline-text-2" id="text-org7e7d807">
</div>
<div id="outline-container-org8d20462" class="outline-3">
<h3 id="org8d20462">problem</h3>
<div class="outline-text-3" id="text-org8d20462">
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A}\mathbf{X}^T)\big) = \mathbf{A}
\end{split}
\end{equation}
</div>
</div>
<div id="outline-container-orgd5ee7b9" class="outline-3">
<h3 id="orgd5ee7b9">derivation</h3>
<div class="outline-text-3" id="text-orgd5ee7b9">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}((\mathbf{A}(\mathbf{X}+\mathbf{H})^T) - \text{Tr}(\mathbf{A}\mathbf{X}^T)
  &= \text{Tr}(\mathbf{A}\mathbf{X}^T) + \text{Tr}(\mathbf{A}\mathbf{H}^T) - \text{Tr}(\mathbf{A}\mathbf{X}^T)\\
  &= \text{Tr}(\mathbf{A}\mathbf{H}^T) \\
  &= \text{Tr}(\mathbf{H}^T\mathbf{A}) \\
  &= \left \langle \mathbf{A}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}

</div>
</div>
</div>
</div>

<div id="outline-container-org277a000" class="outline-2">
<h2 id="org277a000">Eq105</h2>
<div class="outline-text-2" id="text-org277a000">
</div>
<div id="outline-container-orga383ab5" class="outline-3">
<h3 id="orga383ab5">problem</h3>
<div class="outline-text-3" id="text-orga383ab5">
\begin{equation}
\begin{split}
        \frac{\partial }{\partial \mathbf{X}} \big(\text{Tr}(\mathbf{A} \otimes \mathbf{X})\big) = \text{Tr}(\mathbf{A})\mathbf{I}
\end{split}
\end{equation}
</div>
</div>
<div id="outline-container-org4e9bce0" class="outline-3">
<h3 id="org4e9bce0">derivation</h3>
<div class="outline-text-3" id="text-org4e9bce0">
<div class="LaTeX">
\begin{equation}
\begin{split}
  \text{Tr}(\mathbf{A} \otimes (\mathbf{X}+\mathbf{H})) - \text{Tr}(\mathbf{A} \otimes \mathbf{X})
  &= \text{Tr}(\mathbf{A} \otimes \mathbf{X}) + \text{Tr}(\mathbf{A} \otimes \mathbf{H}) - \text{Tr}(\mathbf{A} \otimes \mathbf{X})\\
  &= \text{Tr}(\mathbf{A} \otimes \mathbf{H}) \\
  &= \text{Tr}(\mathbf{A})\text{Tr}(\mathbf{H}) \\
  &= \text{Tr}(\mathbf{A})\text{Tr}(\mathbf{I}\mathbf{H}) \\
  &= \text{Tr}(\mathbf{A}) \left \langle \mathbf{I}, \mathbf{H}  \right \rangle \\
  &= \left \langle \text{Tr}(\mathbf{A}) \mathbf{I}, \mathbf{H}  \right \rangle \\
\end{split}
\end{equation}

</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sun Nov 29 00:26:06 2020 Fri Nov 27 22:15:33 2020</p>
<p class="author">Author: Wan-Duo Kurt Ma Wan-Duo Kurt Ma</p>
<p class="date">Created: 2020-11-29 Sun 01:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
